app/views/listings/_form.html.erb

SELECT "breeds"."name", "breeds"."id" FROM "breeds"
---
    <%= f.label :breed_id %>
    <%= f.grouped_collection_select :breed_id, @myBreeders.order(:name), :breeds, :name, :id, :name, :include_blank => true, :class => 'form-control'%>