app/views/listings/index.html.erb

SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
			 		<li class="list-group-item">Location: <%= listing.breeder.city %> </li>
			 		<% if listing.breed.present? %>