app/views/listings/show.html.erb

		<li> Available? <%= @listing.availability  %> </li>
		<% if @listing.breeder.present? %>
---
SELECT  "breeders".* FROM "breeders" WHERE "breeders"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]