app/views/breeds/index.html.erb

SELECT "breeds".* FROM "breeds"
---

<% if @breed != Breed.all %>