app/controllers/breeds_controller.rb

def index
	@breeds = Breed.all
---
SELECT "breeds".* FROM "breeds"

def show
	@breed = Breed.find params[:id]
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

def create
	@breed = Breed.create breed_params
---
INSERT INTO "breeds" ("name", "origin", "photo", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

def edit
	@breed = Breed.find params[:id]
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]

def update
  breed = Breed.find params[:id]
  breed.update breed_params
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "breeds" SET "photo" = $1, "description" = $2, "updated_at" = $3 WHERE "breeds"."id" = $4  [["photo", "https://www.fillmurray.com/400/600"], ["description", "blah"], ["updated_at", "2021-10-28 08:47:34.397348"], ["id", 53]]

def destroy
  breed = Breed.find params[:id]
  breed.destroy
---
SELECT  "breeds".* FROM "breeds" WHERE "breeds"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "breeds" WHERE "breeds"."id" = $1  [["id", 17]]