app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" INNER JOIN "breeders" ON "listings"."breeder_id" = "breeders"."id" INNER JOIN "breeders_users" ON "breeders"."id" = "breeders_users"."breeder_id" WHERE "breeders_users"."user_id" = $1  [["user_id", 6]]
---
def index
	if @current_user.present? && @current_user.isBreeder?
		@listings = @current_user.listings
	else
		@listings = Listing.all

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
def show
	@listing = Listing.find params[:id]

INSERT INTO "listings" ("image", "name", "price", "description", "created_at", "updated_at", "breeder_id", "breed_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
def create
	@listing = Listing.create listing_params

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
def edit
	@listing = Listing.find params[:id]

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "listings" SET "breeder_id" = $1, "breed_id" = $2, "updated_at" = $3 WHERE "listings"."id" = $4  [["breeder_id", 23], ["breed_id", 13], ["updated_at", "2021-10-28 03:38:05.081325"], ["id", 27]]
---
def update
	listing = Listing.find params[:id]
  listing.update listing_params