app/views/breeders/show.html.erb

SELECT "breeds".* FROM "breeds" INNER JOIN "breeders_breeds" ON "breeds"."id" = "breeders_breeds"."breed_id" WHERE "breeders_breeds"."breeder_id" = $1  [["breeder_id", 25]]
---
	<h2>Our breeds </h2>
<% @breeder.breeds.each do |breed| %>